In [1]:
import pandas as pd

In [4]:
items = {'Bob': pd.Series([245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice': pd.Series([40, 110, 500, 45], index=['book', 'glasses', 'bike', 'pants'])}

type(items)

dict

In [6]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [7]:
data = {'Bob': pd.Series([245, 25, 55]),
       'Alice': pd.Series([40, 110, 500, 45])}

df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [8]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [9]:
shopping_carts.shape

(5, 2)

In [10]:
shopping_carts.ndim

2

In [11]:
shopping_carts.size

10

In [14]:
# select elements by column

bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [17]:
# select data by rows
sel_shopping_cart = pd.DataFrame(items, index=['pandas', 'book', 'pants'])
sel_shopping_cart

         Bob  Alice
pandas   NaN    NaN
book     NaN   40.0
pants   25.0   45.0

In [19]:
#select elements by both rows and columns

alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [20]:
#mix values type data frames

data = {'Integers': [1, 2, 3],
       'Floats': [4.5, 8.2, 9.6]}

pd.DataFrame(data)

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [21]:
#adding index to data frame

df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [25]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35},
        {'watches': 10, 'glasses': 50, 'bikes':15, 'pants': 5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [26]:
# access one element
store_items['bikes']

store 1    20
store 2    15
Name: bikes, dtype: int64

In [28]:
# access multiple column items
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [29]:
# access row items
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [30]:
# access columns first, then rows

store_items['bikes']['store 2']

15

In [33]:
# add new column
store_items['shirts'] = [15, 2]
store_items

         bikes  glasses  pants  watches  shirt  shirts
store 1     20      NaN     30       35     15      15
store 2     15     50.0      5       10      2       2

In [34]:
# add new column using arithmetic

store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirt  shirts  suits
store 1     20      NaN     30       35     15      15     45
store 2     15     50.0      5       10      2       2      7

In [38]:
# to create a new row

# 1. create a new pandas DataFrame
new_items = [{'bike': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bike  glasses  pants  watches
store 3    20        4     30       35

In [39]:
#2 append it to the last pandas dataframe

store_items = store_items.append(new_store)
store_items

C:\Users\lhtac\Anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

         bike  bikes  glasses  pants  shirt  shirts  suits  watches
store 1   NaN   20.0      NaN     30   15.0    15.0   45.0       35
store 2   NaN   15.0     50.0      5    2.0     2.0    7.0       10
store 3  20.0    NaN      4.0     30    NaN     NaN    NaN       35

In [40]:
# add new elements by assigning new key-value pairs
store_items['new_watches'] = store_items['watches'][1:]

store_items

,bike,bikes,glasses,pants,shirt,shirts,suits,watches,new_watches
store 1,NaN,20.0,NaN,30,15.0,15.0,45.0,35,NaN
store 2,NaN,15.0,50.0,5,2.0,2.0,7.0,10,10.0
store 3,20.0,NaN,4.0,30,NaN,NaN,NaN,35,35.0

In [41]:
# insert new element

store_items.insert(5, 'shoes', [8, 5, 0])
store_items

,bike,bikes,glasses,pants,shirt,shoes,shirts,suits,watches,new_watches
store 1,NaN,20.0,NaN,30,15.0,8,15.0,45.0,35,NaN
store 2,NaN,15.0,50.0,5,2.0,5,2.0,7.0,10,10.0
store 3,20.0,NaN,4.0,30,NaN,0,NaN,NaN,35,35.0

In [42]:
# remove column
store_items.pop('new_watches')
store_items

         bike  bikes  glasses  pants  shirt  shoes  shirts  suits  watches
store 1   NaN   20.0      NaN     30   15.0      8    15.0   45.0       35
store 2   NaN   15.0     50.0      5    2.0      5     2.0    7.0       10
store 3  20.0    NaN      4.0     30    NaN      0     NaN    NaN       35

In [43]:
# drop columns elements from dataframe
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bike  bikes  glasses  pants  shirt  shirts  suits
store 1   NaN   20.0      NaN     30   15.0    15.0   45.0
store 2   NaN   15.0     50.0      5    2.0     2.0    7.0
store 3  20.0    NaN      4.0     30    NaN     NaN    NaN

In [44]:
# drop rows elements from dataframe

store_items = store_items.drop(['store 1', 'store 2'], axis=0)
store_items

         bike  bikes  glasses  pants  shirt  shirts  suits
store 3  20.0    NaN      4.0     30    NaN     NaN    NaN

In [45]:
# rename column labels

store_items = store_items.rename(columns={'bikes':'hats'})
store_items

         bike  hats  glasses  pants  shirt  shirts  suits
store 3  20.0   NaN      4.0     30    NaN     NaN    NaN

In [46]:
#rename row index

store_items = store_items.rename(index={'store 3':'last store'})
store_items

            bike  hats  glasses  pants  shirt  shirts  suits
last store  20.0   NaN      4.0     30    NaN     NaN    NaN

In [48]:
# make change row index to column index
store_items = store_items.set_index('pants')
store_items

       bike  hats  glasses  shirt  shirts  suits
pants
30     20.0   NaN      4.0    NaN     NaN    NaN